# CreateTextureBitmapD

## Description
This function takes a shader record and creates a Texture bitmap.

```pascal
FUNCTION CreateTextureBitmapD(parentShaderRecord : HANDLE): HANDLE;
```

```python
def vs.CreateTextureBitmapD(parentShaderRecord):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|parentShaderRecord|HANDLE|This is the shader record input that the texture bitmap will be attached to.|

## See Also
VS Functions:
SetTextureBitmap
| CreateShaderRecord

## Version
Availability: from Vectorworks 2019

## Category
* Textures